app/controllers/api/v1/item_controller.rb

SELECT "sizes".* FROM "sizes"ItemDevLog:   ↳ app/controllers/api/v1/item_controller.rb:23:in `indexItem'ItemDevLog:   Company Load (1.7ms)  SELECT "companies".* FROM "companies"ItemDevLog:   ↳ app/controllers/api/v1/item_controller.rb:23:in `indexItem'ItemDevLog: Completed 200 OK in 396ms (Views: 8.7ms | ActiveRecord: 35.1ms | Allocations: 11085)
---
    def indexItem
      @sizes = Size.all